[
    {
        "courseId": "15100114",
        "courseName": " Γραμμική Άλγεβρα",
        "semester": [1],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 2,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": []
        },
        "description": "Το μάθημα καλύπτει βασικά και προχωρημένα θέματα της Γραμμικής Άλγεβρας, που αποτελούν απαραίτητο υπόβαθρο σε όλους τους κλάδους των Θετικών Επιστημών. Εισαγωγικές έννοιες, Πίνακες, Συστήματα Γραμμικών Εξισώσεων, Διανυσματικοί χώροι, Γραμμικές απεικονίσεις, Γραμμικές απεικονίσεις και πίνακες, Πολυώνυμα, Ιδιοτιμές και Διαγωνισιμότητα, Κανονικές μορφές, Διαγωνοποίηση Ερμιτιανών πινάκων, Διανυσματικοί χώροι με εσωτερικό γινόμενο.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Γραμμική Άλγεβρα - η-Τάξη",
                    "url": "https://eclass.uoa.gr/main/login_form.php?next=%2Fcourses%2FMATH256%2F"
                }
            ],
            "bibliography": [
                "Εισαγωγή στη Γραμμική Άλγεβρα Βάρσος, Δεριζιώτης, Μαλιάκας,Ταλέλλη",
                "Γραμμική Άλγεβρα, Δονάτος, Αδάμ"
            ]
        }
    },
    {
        "courseId": "15100010",
        "courseName": "Διακριτά Μαθηματικά",
        "semester": [1],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 7,
        "teachingHours": {
            "theory": 4,
            "tutoring": 2,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": []
        },
        "description": "Το μάθημα συνίσταται στην παρουσίαση των εξής εννοιών: Σύνολα, προτάσεις, επαγωγή, διμελείς σχέσεις, συναρτήσεις, μεταθέσεις, συνδυασμοί, διακριτή πιθανότητα, δεσμευμένη πιθανότητα, ανεξάρτητα γεγονότα, θεώρημα Bayes, αριθμητικές συναρτήσεις, ασυμπτωτική συμπεριφορά αριθμητικών συναρτήσεων. Δίδονται φροντιστηριακές ασκήσεις για την επίλυση προβλημάτων επί της ύλης και τελική εξέταση.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Διακριτά Μαθηματικά - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D268/"
                }
            ],
            "bibliography": [
                "K.H. Rosen. Διακριτά Μαθηματικά και Εφαρμογές τους.7η Έκδοση, Εκδόσεις Τζιόλα, 2015. Πρωτότυπο: Discrete Mathematics and its Applications (6th Edition). McGraw-Hill, 2007. Είναι το βασικό σύγγραμμα, το οποίο και ακολουθούμε στις διαλέξεις.",
                "C.L. Liu. Στοιχεία Διακριτών Μαθηματικών (απόδοση στα Ελληνικά: Κ. Μπους και Δ. Γραμμένος). Πανεπιστημιακές Εκδόσεις Κρήτης, 2003.",
                "Λ. Κυρούσης, Χ. Μπούρας, Π. Σπυράκης. Διακριτά Μαθηματικά: Τα Μαθηματικά της Επιστήμης των Υπολογιστών. Gutenberg, 1994.",
                "Cormen, Leiserson, Rivest, Stein. Εισαγωγή στους αλγόριθμους, Πανεπιστημιακές εκδόσεις Κρήτης. Βασικό σύγγραμμα στο \"Αλγόριθμοι και Πολυπλοκότητα\". • Η. Κουτσουπιάς. Μαθηματικά της Πληροφορικής. ΕΚΠΑ, 2008."
            ]
        }
    },
    {
        "courseId": "15100084",
        "courseName": "Εισαγωγή στον Προγραμματισμό",
        "semester": [1],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 7,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 2
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": []
        },
        "description": "Γενικά περί υπολογιστών και προγραμματισμού υπολογιστών. Ιστορική αναδρομή. Η δομή του υπολογιστή. Η πληροφορία στον υπολογιστή. Λογισμικό και γλώσσες προγραμματισμού. Απαιτήσεις από μια διαδικαστική γλώσσα προγραμματισμού. Εκτελέσιμα προγράμματα. Μεταγλώττιση και σύνδεση. Η γλώσσα προγραμματισμού C. Προγραμματιστικά περιβάλλοντα για την C. Ο μεταγλωττιστής gcc. Παραδείγματα απλών προγραμμάτων στην C. Χαρακτηριστικά και δυνατότητες της C. Μεταβλητές, σταθερές, τύποι και δηλώσεις. Εντολές αντικατάστασης, τελεστές και παραστάσεις. Η ροή του ελέγχου. Δομή προγράμματος, συναρτήσεις και εξωτερικές μεταβλητές. Εμβέλεια και χρόνος ζωής μεταβλητών. Αναδρομή. Διευθύνσεις θέσεων μνήμης, δείκτες και πίνακες. Δυναμική δέσμευση μνήμης. Συμβολοσειρές. Πίνακες δεικτών, δείκτες σε δείκτες και πολυδιάστατοι πίνακες. Δείκτες σε συναρτήσεις. Ορίσματα γραμμής εντολών. Απαριθμήσεις, δομές, αυτο-αναφορικές δομές (λίστες, δυαδικά δέντρα), ενώσεις, πεδία bit και δημιουργία νέων ονομάτων τύπων. Είσοδος και έξοδος. Χειρισμός αρχείων. Προεπεξεργαστής της C και μακροεντολές. Αλγόριθμοι ταξινόμησης πινάκων και αναζήτησης σε πίνακες. Οδηγίες σωστού προγραμματισμού. Συχνά προγραμματιστικά λάθη στην C.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Εισαγωγή στον Προγραμματισμό - η-Τάξη",
                    "url": "https://eclass.uoa.gr/courses/D8/"
                }
            ],
            "bibliography": [
                "Π. Σταματόπουλος, «Σημειώσεις Εισαγωγής στον Προγραμματισμό» και «Φυλλάδια Εργαστηρίων», 2017.",
                "Brian W. Kernighan, Dennis M. Ritchie. \"Η Γλώσσα Προγραμματισμού C\", Prentice-Hall (Ελληνική μετάφραση, εκδόσεις Κλειδάριθμος), 1988",
                "Γ. Σ. Τσελίκης, Ν. Δ. Τσελίκας. \"C: Από τη Θεωρία στην Εφαρμογή\", 3η έκδοση, 2016.",
                "Νικόλαος Μισυρλής. \"Εισαγωγή στον Προγραμματισμό με την C\", 3η έκδοση, 2007.",
                "Νίκος Χατζηγιαννάκης. \"Η Γλώσσα C σε Βάθος\", 5η έκδοση, εκδόσεις Κλειδάριθμος, 2017.",
                "Δημήτριος Καρολίδης. \"Μαθαίνετε Εύκολα C\", 2013."
            ]
        }
    },
    {
        "courseId": "15100001",
        "courseName": "Ανάλυση Ι",
        "semester": [2],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 8,
        "teachingHours": {
            "theory": 4,
            "tutoring": 2,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": []
        },
        "description": "Βασικές τοπολογικές έννοιες. Πραγματικοί αριθμοί, ακολουθίες, σειρές. Συναρτήσεις (όριο, συνέχεια, στοιχειώδεις συναρτήσεις). Ορισμένο ολοκλήρωμα (βασικές ιδιότητες). Παράγωγος (βασικές ιδιότητες). Αόριστο ολοκλήρωμα, γενικευμένο ολοκλήρωμα (μέθοδοι υπολογισμού). Δυναμοσειρές.",
        "additionalInformation": {
            "links": [],
            "bibliography": []
        }
    },
    {
        "courseId": "15100084",
        "courseName": "Δομές Δεδομένων και Τεχνικές Προγραμματισμού",
        "semester": [2],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 7,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 1
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Εισαγωγή στον Προγραμματισμό"]
        },
        "description": "Δείκτες και συνδεδεμένες αναπαραστάσεις στη γλώσσα προγραμματισμού C. Αναδρομή. Ενότητες και Αφαιρετικοί Τύποι Δεδομένων. Στοίβες. Ουρές. Εισαγωγή στην Ανάλυση Αλγορίθμων. Λίστες και Συμβολοσειρές. Δένδρα, σωροί, δένδρα εκφράσεων. Δένδρα δυαδικής αναζήτησης. AVL δένδρα. Δένδρα αναζήτησης m δρόμων, δένδρα 2-3, δένδρα 2-3-4. Β-δένδρα. Κόκκινα-μαύρα δένδρα. Κατακερματισμός. Σύνολα ξένα μεταξύ τους. Γράφοι και αλγόριθμοι για γράφους. Ταξινόμηση.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Δομές Δεδομένων και Τεχνικές Προγραμματισμού (Τμήμα Άρτιων ΑΜ) - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D419/"
                }
            ],
            "bibliography": [
                "Thomas A. Standish: Data Structures, Algorithms and Software Principles in C, Addison-Wesley. 1995.",
                "Robert Sedgewick: Αλγόριθμοι σε C, Εκδόσεις Κλειδάριθμος, 2006.",
                "Michael T. Goodrich, Roberto Tamassia: Δομές Δεδομένων & Αλγόριθμοι σε JAVA, Εκδόσεις Δίαυλος, 2013",
                "Λεπτομερείς διαφάνειες από τις διαλέξεις.",
                "Άλλο σχετικό υλικό που βρίσκεται στην ιστοσελίδα του μαθήματος."
            ]
        }
    },
    {
        "courseId": "15100202",
        "courseName": "Αρχιτεκτονική Υπολογιστών Ι",
        "semester": [2],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 7,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 1
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Λογική Σχεδίαση"]
        },
        "description": "Εισαγωγή στην τεχνολογία των υπολογιστών, εντολές και επίπεδα αναπαράστασης, αναπαράσταση αριθμητικών και μη-αριθμητικών δεδομένων, οργάνωση τυπικού υπολογιστή, αρχιτεκτονική συνόλου εντολών (ISA), μικροαρχιτεκτονική, υπολογιστές RISC και CISC, MIPS ISA, καταχωρητές, μορφή και κωδικοποίηση εντολών, τρόποι διευθυνσιοδότησης, λειτουργίες αριθμητικές, λογικές και μεταφοράς δεδομένων, λειτουργίες ελέγχου ροής προγράμματος, υποστήριξη διαδικασιών στο υλικό, χρήση της στοίβας, βασικές έννοιες της μεταγλώττισης, αξιολόγηση και κατανόηση της απόδοσης, μέτρηση της απόδοσης, παράγοντες που επιδρούν στην απόδοση, αξιολόγηση της απόδοσης, σχεδίαση επεξεργαστή, μονάδες διαδρομής δεδομένων, σχεδίαση διαδρομής δεδομένων, σχεδίαση μονάδας ελέγχου, υλοποίηση ενός κύκλου, υλοποίηση πολλών κύκλων, μικροπρογραμματισμός.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Αρχιτεκτονική Υπολογιστών Ι - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D19/"
                }
            ],
            "bibliography": []
        }
    },
    {
        "courseId": "15100006",
        "courseName": "Ανάλυση ΙΙ",
        "semester": [3],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 8,
        "teachingHours": {
            "theory": 4,
            "tutoring": 2,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Ανάλυση Ι"]
        },
        "description": "• Διανύσματα, διανυσματικές συναρτήσεις στο επίπεδο και στο χώρο. Εσωτερικό - εξωτερικό γινόμενο. Ευθείες – επίπεδα - επιφάνειες. Μήκος τόξου, μοναδιαίο εφαπτόμενο διάνυσμα. Σύστημα αναφοράς TNB. Συναρτήσεις πολλών μεταβλητών - παράγωγοι. Όριο - συνέχεια.\n• Μερικές παράγωγοι. Αλυσιδωτή παραγώγιση, κατευθυνόμενη παράγωγος, διανύσματα κλίσεως, εφαπτόμενα επίπεδα, γραμμικοποίηση, διαφορικά. Ακρότατα, σαγματικά σημεία.\n• Τύπος του Τaylor για συναρτήσεις πολλών μεταβλητών.\n• Καμπυλόγραμμα συστήματα συντεταγμένων, μετρική, βαθμίδα, απόκλιση, στροβιλισμός.\n• Πολλαπλά (διπλά, τριπλά) ολοκληρώματα, σε καρτεσιανές και άλλες συντεταγμένες. Εφαρμογές στον υπολογισμό εμβαδών, ροπών, κέντρων μάζας. Αλλαγές μεταβλητών (Ιακωβιανές ορίζουσες).\n• Ολοκλήρωση διανυσματικών πεδίων. Επικαμπύλια και επιφανειακά ολοκληρώματα. Ανεξαρτησία από τη διαδρομή, συναρτήσεις δυναμικού και συντηρητικά πεδία. Θεωρήματα Green, Gauss, Stokes και εφαρμογές.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Ανάλυση ΙΙ - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D260/"
                }
            ],
            "bibliography": [
                "Διανυσματικός Λογισμός, Marsden J., Α. Tromba, ΙΤΕ ΠΑΝ/ΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ, • Απειροστικός Λογισμός (σε έναν Τόμο), B. Tomas, ΙΤΕ ΠΑΝ/ΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ",
                "Απειροστικός Λογισμός σε πολλές μεταβλητές, Τ. Χατζηαφράτης, ΕΚΔΟΣΕΙΣ Σ.ΑΘΑΝΑΣΟΠΟΥΛΟΣ& ΣΙΑ Ο.Ε",
                "Εφαρμοσμένος Απειροστικός Λογισμός, Λ.Ν. Τσίτσας, ΕΚΔΟΣΕΙΣ Σ.ΑΘΑΝΑΣΟΠΟΥΛΟΣ& ΣΙΑ Ο.Ε",
                "Μαθηματικά ΙΙ, Β’ έκδοση, Θ. Μ. Ρασσίας, ΕΚΔΟΣΕΙΣ ΑΘ. ΤΣΟΤΡΑΣ"
            ]
        }
    },
    {
        "courseId": "15100429",
        "courseName": "Αντικειμενοστραφής Προγραμματισμός",
        "semester": [3],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 8,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 2
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Εισαγωγή στον Προγραμματισμό"]
        },
        "description": "Γενικά για τον αντικειμενοστραφή προγραμματισμό και τις κλάσεις. Η γλώσσα προγραμματισμού C++. Βασικά στοιχεία, χώροι ονομάτων, υπερφόρτωση, κλάσεις, αντικείμενα, κληρονομικότητα, σύνθεση, πρότυπα, αφηρημένες κλάσεις, χειρισμός εξαιρέσεων, περιγραφή της καθιερωμένης βιβλιοθήκης, περιγραφή της STL. Σχεδιασμός και προγραμματισμός με τη C++. Γενική περιγραφή της γλώσσας Java. Άλλες γλώσσες αντικειμενοστραφούς προγραμματισμού. Θεωρητικά θέματα σχετικά με τα αντικείμενα.",
        "additionalInformation": {
            "links": [],
            "bibliography": [
                "Ι. Καράλη: «ΣΗΜΕΙΩΣΕΙΣ ΑΝΤΙΚΕΙΜΕΝΟΣΤΡΑΦΟΥΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ», 2010",
                "Ι. Καράλη: «Σημειώσεις για τη Γλώσσα Προγραμματισμού Java», 2014",
                "Bruce Eckel, «Τρόπος Σκέψης στη C++, Τόμος 1», εκδόσεις «Μ. Γκιούρδας», 2009",
                "Bjarne Strοustrup, «Η Γλώσσα Προγραμματισμού C++» (Τέταρτη Αμερικάνικη Έκδοση), εκδόσεις «Κλειδάριθμος», 2014",
                "Bjarne Strοustrup, «Προγραμματισμός με τη C++», εκδόσεις «Παπασωτηρίου», 2009"
            ]
        }
    },
    {
        "courseId": "15100126",
        "courseName": "Σήματα και Συστήματα",
        "semester": [3],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Ανάλυση Ι"]
        },
        "description": "Βασικές κατηγορίες σημάτων, φασματική αναπαράσταση περιοδικών και απεριοδικών σημάτων, βασικές κατηγορίες συστημάτων, συγκεραστική αναπαράσταση, καταστατικά μοντέλα, περιγραφή συστημάτων με διαφορικές εξισώσεις και εξισώσεις πεπερασμένων διαφορών, μετασχηματισμοί Fourier, Laplace και Z, διαγράμματα Bode, ευστάθεια, δειγματοληψία και κβάντιση.",
        "additionalInformation": {
            "links": [],
            "bibliography": [
                "Σεραφείμ Καραμπογιάς \"Σήματα και Συστήματα\", ΕΚΠΑ, 2009, ISBN 978-960-931517-3",
                "Νίκος Καλουπτσίδης \"Σήματα Συστήματα και Αλγόριθμοι\", εκδόσεις ΔΙΑΥΛΟΣ, 1993",
                "Σέργιος Θεοδωρίδης, Κώστας Μπερμπερίδης, Λευτέρης Κοφίδης \"Εισαγωγή στη Θεωρία Σημάτων και Συστημάτων\" εκδόσεις Γ. Δαρδανος-Κ. Δαρδανος, 2003"
            ]
        }
    },
    {
        "courseId": "15100090",
        "courseName": "Αλγόριθμοι και Πολυπλοκότητα",
        "semester": [4],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 8,
        "teachingHours": {
            "theory": 4,
            "tutoring": 2,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Δομές Δεδομένων και Τεχνικές Προγραμματισμού", "Διακριτά Μαθηματικά"]
        },
        "description": "Το μάθημα εισάγει τις έννοιες της σχεδίασης και ανάλυσης του αλγορίθμου και παρουσιάζει τα βασικά μαθηματικά εργαλεία που χρησιμοποιούνται για την αποτίμηση της απόδοσής του. Περιγράφει τις τεχνικές αναζήτησης σε σύνολα (union and find) και παρουσιάζει τις θεμελιώδεις τεχνικές διάσχισης σε γραφήματα, κατά πλάτος (BFS) και κατά βάθος (DFS). Εστιάζει στις τρεις βασικές μεθόδους σχεδίασης αλγορίθμων, “διαίρει και βασίλευε”, άπληστοι (greedy) αλγόριθμοι και δυναμικός προγραμματισμός. Αναλύει τα χαρακτηριστικά κάθε μεθόδου και αναδεικνύει τα πρακτικά προβλήματα που επιλύονται αποτελεσματικά από κάθε μέθοδο. Ορίζει τα προβλήματα απόφασης και τις κλάσεις P και NP. Περιγράφει την έννοια της αναγωγής και προσδιορίζει τα προβλήματα NP-complete και NP-hard.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Σημειώσεις, Αλγόριθμοι και Πολυπλοκότητα, 2016, Β. Ζησιμόπουλος",
                    "url": "https://eclass.uoa.gr/modules/document/index.php?course=D469&openDir=/4c2b32c4z3e6"
                },
                {
                    "name": "Διαφάνειες διαλέξεων",
                    "url": "https://eclass.uoa.gr/modules/document/index.php?course=D469&openDir=/4c2b32c4rt6n"
                }
            ],
            "bibliography": [
                "Th. H. Cormen, CH. E. Leiserson, R. L. Rivest and C. Stein, Introduction to algorithms, MIT-Press, 2009, 3rd edition, MIT Press, http://mitpress.mit.edu/algorithms/ (Εύδοξος).",
                "Jon Kleinberg & Eva Tardos, Algorithm Design, Addison – Wesley, 2006 (Εύδοξος).",
                "S. Dasgupta, C. H. Papadimitriou & U. V. Vazirani, Algorithms, McGraw-Hill, 2008 (Εύδοξος)."
            ]
        }
    },
    {
        "courseId": "15100472",
        "courseName": "Συστήματα Επικοινωνιών",
        "semester": [4],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 7,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 1
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Σήματα και Συστήματα"]
        },
        "description": "Εισαγωγή στα Τηλεπικοινωνιακά Συστήματα, Ανασκόπηση Θεωρίας Σημάτων, Τυχαίες Διαδικασίες και Θόρυβος, Αναλογικές Επικοινωνίες (Διαμόρφωση Πλάτους και Φάσης), Μετατροπή Αναλογικού Σήματος σε Ψηφιακό και από Ψηφιακό σε Αναλογικό, Ψηφιακή Εκπομπή και Λήψη, Εργαστήριο Προσομοίωσης Επικοινωνιακών Συστημάτων σε MATLAB. Το μάθημα επικεντρώνεται στα συστήματα επικοινωνιών καλύπτοντας τα βασικότερα δομικά στοιχεία λειτουργίας τους και τις θεμελιώδεις τεχνικές επεξεργασίας σήματος που τα διέπουν. Στο πρώτο μέρος του μαθήματος περιλαμβάνεται η επισκόπηση βασικών ορισμών σημάτων κι ο μετασχηματισμός Fourier, τα γραμμικά και χρονικά ανεξάρτητα συστήματα, η συνέλιξη και συναρτήσεις συσχέτισης, ο ορισμός των ζωνοπερατών σημάτων, το μιγαδικό ισοδύναμο βασικής ζώνης κι ο μετασχηματισμός Hilbert. Επίσης, περιλαμβάνεται ο ορισμός των στοχαστικών διαδικασιών, οι έννοιες της στασιμότητας, εργοδικότητας, αυτοσυσχέτισης κι ετεροσυσχέτισης, η φασματική πυκνότητα ισχύος, καθώς κι ο θερμικός θόρυβος με τις ιδιότητές του. Τέλος, αναλύονται τα βασικότερα δομικά στοιχεία συστημάτων επικοινωνιών. Το δεύτερο μέρος του μαθήματος επικεντρώνεται στις αναλογικές επικοινωνίες και στη μελέτη γενικευμένων σχημάτων εκπομπής και λήψης, αναλύοντας τις διαμορφώσεις πλάτους (AM: amplitude modulation), φάσης (PM: phase modulation) και συχνότητας (FM: frequency modulation). Επίσης, περιγράφονται βασικές ηλεκτρονικές διατάξεις διαμόρφωσης κι αποδιαμόρφωσης και γίνεται μελέτη του θορύβου μέσω της ανάλυσης της επίδρασής του στη διαμόρφωση πλάτους. Τέλος, περιγράφεται αναλυτικά η μετατροπή αναλογικού σήματος σε ψηφιακό κι αντίστροφα, το θεώρημα δειγματοληψίας και το κριτήριο Nyquist, η κβάντιση κι οι κωδικοποιήσεις PCM (pulse code modulation), DPCM (differential PCM) και Δέλτα. Το τελευταίο τρίτο μέρος του μαθήματος επικεντρώνεται στα ψηφιακά συστήματα επικοινωνιών, αναλύοντας το κανάλι του προσθετικού λευκού θορύβου Gaussian (AWGN: additive white Gaussian noise) και μελετώντας την ορθογώνια αναπαράσταση σημάτων, τη διαδικασία Gram-Schmidt και βασικούς αστερισμούς. Περιγράφεται λεπτομερώς ένας γενικευμένος ψηφιακός δέκτης κι η αποδιαμόρφωση και βέλτιστη ανίχνευση σε κανάλι AWGN. Τέλος, παρουσιάζονται βασικές ψηφιακές διαμορφώσεις και γίνεται μελέτη της συμπεριφοράς τους.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Συστήματα Επικοινωνιών - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/DI625"
                }
            ],
            "bibliography": [
                "Γ. Καραγιαννίδης Γεώργιος και Κ. Παππή Τηλεπικοινωνιακά Συστήματα, 4η Έκδοση 2017 ΕΚΔΟΣΕΙΣ Α. ΤΖΙΟΛΑ & ΥΙΟΙ Α.Ε.",
                "H. Taub και D. L. SchillingΑρχές Τηλεπικοινωνιακών Συστημάτων, 3η Έκδοση 2006 ΕΚΔΟΣΕΙΣ Α. ΤΖΙΟΛΑ & ΥΙΟΙ Α.Ε."
            ]
        }
    },
    {
        "courseId": "15100471",
        "courseName": "Σχεδίαση και Χρήση Βάσεων Δεδομένων",
        "semester": [4],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 7,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 1
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": ["Δομές Δεδομένων και Τεχνικές Προγραμματισμού"]
        },
        "description": "Το μάθημα \"Σχεδίαση και Χρήση Βάσεων Δεδομένων\" είναι το πρώτο από τα δύο βασικά μαθήματα Βάσεων Δεδομένων στο Πρόγραμμα Προπτυχιακών Σπουδών και καλύπτει θέματα των επάνω στρωμάτων ενός συστήματος βάσεων δεδομένων, δηλ., του \"λογικού\" και του \"σημασιολογικού\" επιπέδου, και της εξωτερικής διάδρασης. (Το δεύτερο είναι το μάθημα \"Υλοποίηση Συστημάτων Βάσεων Δεδομένων\", στο 5ο εξάμηνο, το οποίο καλύπτει θέματα που αφορούν στα χαμηλότερα στρώματα, δηλ., το \"φυσικό\" επίπεδο, με ευρετήρια, κτλ.). Συγκεκριμένα, το μάθημα καλύπτει τα εξής: μοντέλο Οντοτήτων-Συσχετίσεων (Ο/Σ), σχεδιασμός σχημάτων βάσεων με το μοντέλο Ο/Σ, σχεσιακό μοντέλο δεδομένων, μετάφραση από το Ο/Σ στο σχεσιακό, μελέτη σχεσιακών σχημάτων με επίκεντρο τις συναρτησιακές εξαρτήσεις, κανονικές μορφές σχεσιακών σχημάτων, η γλώσσα SQL, η γλώσσα QBE, φόρμες επικοινωνίας, κατάλογοι συστήματος, όψεις, περιορισμοί, ανάπτυξη εφαρμογών με ενσωματωμένη SQL, ανάπτυξη εφαρμογών πάνω από πρότυπες διεπαφές επικοινωνίας με βάσεις (python, και ίσως PHP, JDBC), βάσεις και διαδίκτυο. Εκτός από την κάλυψη της ύλης, το μάθημα περιλαμβάνει εργασία με 3 υποχρεωτικές ασκήσεις και ένα τελικό διαγώνισμα, το σύνολο των οποίων θα αποφασίσουν τον τελικό βαθμό.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Σχεδίαση και Χρήση Βάσεων Δεδομένων - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D47/"
                }
            ],
            "bibliography": [
                "Βασικό σύγγραμμα (Εύδοξος) Elmasri, R., & Navathe, S. B. (2016). Θεμελιώδεις αρχές συστημάτων βάσεων δεδομένων (7η έκδοση). ΔΙΑΥΛΟΣ Α.Ε. ΕΚΔΟΣΕΙΣ ΒΙΒΛΙΩΝ.",
                "Επικουρικό σύγγραμμα (Εύδοξος) Ullman, J. D., & Widom, J. (2008). Βασικές αρχές για τα συστήματα βάσεων δεδομένων (2η). ΕΚΔΟΣΕΙΣ ΚΛΕΙΔΑΡΙΘΜΟΣ ΕΠΕ."
            ]
        }
    },
    {
        "courseId": "15100408",
        "courseName": "Λειτουργικά Συστήματα",
        "semester": [5],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 8,
        "teachingHours": {
            "theory": 4,
            "tutoring": 0,
            "lab": 1
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": ["Δομές Δεδομένων και Τεχνικές Προγραμματισμού"],
            "optional": ["Αρχιτεκτονική Υπολογιστών Ι"]
        },
        "description": "Ο σκοπός αυτού του μαθήματος είναι να εξετάσει τις βασικές ιδέες και αρχές των μοντέρνων Λειτουργικών Συστημάτων (ΛΣ): υπηρεσίες, προγράμματα και κλήσεις συστήματος, δομές πυρήνα, βασικές μέθοδοι εισόδου-εξόδου σε υπολογιστικά συστήματα, διαχωρισμός υπολογιστικών εργασιών πυρήνα και χώρο-χρήστη, οργάνωση διεργασιών στην μνήμη, χάρτες μνήμης, κοινά προσπελάσιμα τμήματα μνήμης, συγχρονισμός μεταξύ διεργασιών, τεχνικές διαχείρισης μνήμης, βασικές πολιτικές για κατανομή πόρων, συστήματα αρχείων, είσοδος και έξοδος, αδιέξοδα, υπολογιστικά νήματα και βασικές αρχές ασφάλειας Λειτουργικών Συστημάτων. Τα διάφορα κομμάτια των ΛΣ θα συζητηθούν σε σχέση με τη λειτουργία, τη δομή και την υλοποίησή τους. Η φύση του μαθήματος απαιτεί αυτενέργεια, συνεχή προσωπική προσπάθεια και εργασία κατανεμημένη στη διάρκεια όλου του εξαμήνου.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Λειτουργικά Συστήματα (Χατζηευθυμιάδης) - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D244/"
                },
                {
                    "name": "Λειτουργικά Συστήματα (Δελής) - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/F120/"
                }
            ],
            "bibliography": [
                "Βασικό σύγγραμμα: A. Silberschatz, P.B. Galvin, G. Gagne,Operating System Concepts,9th Edition, John Wiley & Sons, Inc., 2013.",
                "Επικουρικό σύγγραμμα: R. Arpaci-Dusseau and A. Arpaci-Dusseau,Operating Systems: Three Easy Pieces, Arpaci-Dusseau Books,LLC, 2016."
            ]
        }
    },
    {
        "courseId": "15100065",
        "courseName": "Τεχνητή Νοημοσύνη I",
        "semester": [5],
        "category": "Προαιρετικό",
        "fieldOfStudies": "CS (Computer Science)",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 0
        },
        "majors": [
            {
                "majorType": "Διαχείριση Δεδομένων και Γνώσης (S2)",
                "cardinality": "B Βασικό"
            },
            {
                "majorType": "Λογισμικό (S3)",
                "cardinality": "B Βασικό"
            }
        ],
        "relevantCourses": {
            "mandatory": ["Δομές Δεδομένων και Τεχνικές Προγραμματισμού"]
        },
        "description": "Εισαγωγή στην Τεχνητή Νοημοσύνη. Ευφυείς πράκτορες. Λύση προβλημάτων με πράκτορες αναζήτησης (search agents). Στρατηγικές αναζήτησης: breadth-first search, uniform-cost search, depth-first search, depth-limited search, iterative deepening depth-first search, bi-directional search. Ευρετικές στρατηγικές αναζήτησης: greedy best-first search, A*-search. Αλγόριθμοι τοπικής αναζήτησης (local search). Προβλήματα ικανοποίησης περιορισμών (constraint satisfaction problems), λύση προβλημάτων ικανοποίησης περιορισμών με διάφορες παραλλαγές του backtracking search. Πράκτορες για αναπαράσταση γνώσης και λογισμό. Προτασιακή λογική και λογική πρώτης τάξης. Χρήση της προτασιακής και της λογικής πρώτης τάξης για αναπαράσταση γνώσης. Βάσεις γνώσεων και οντολογίες, παραδείγματα από διάφορες εφαρμογές. Συλλογιστική. Μodus ponens, unification, forward and backward chaining, resolution. Εισαγωγή στο λογικό προγραμματισμό και τη γλώσσα Prolog.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Τεχνητή Νοημοσύνη - webpage",
                    "url": "http://cgi.di.uoa.gr/~ys02"
                }
            ],
            "bibliography": [
                "Stuart Russel and Peter Norvig. Artificial Intelligence: A Μodern Approach, Prentice Hall, 2nd edition (2003). http://aima.cs.berkeley.edu/. Το βιβλίο έχει εκδοθεί στα Ελληνικά από τις εκδόσεις Κλειδάριθμος με τον τίτλο «Τεχνητή Νοημοσύνη: Μια σύγχρονη προσέγγιση». http://aima.uom.gr/",
                "Ι. Βλαχάβα, Π. Κεφαλά, Ν. Βασιλειάδη, Φ. Κόκκορα και Η. Σακελαρίου. Τεχνητή Νοημοσύνη. Εκδοτικός οίκος «Β. Γκιούρδας Εκδοτική - Μονοπρόσωπη ΕΠΕ». http://aibook.csd.auth.gr",
                "Λεπτομερείς διαφάνειες από τις διαλέξεις. Οι διαφάνειες βασίζονται κυρίως στο παραπάνω βιβλίο των Russel και Norvig.",
                "Άλλο σχετικό υλικό που βρίσκεται στην ιστοσελίδα του μαθήματος."
            ]
        }
    },
    {
        "courseId": "15100129",
        "courseName": "Κύματα, Κυματοδηγοί, Κεραίες",
        "semester": [5],
        "category": "Προαιρετικό",
        "fieldOfStudies": "CΕT (Computer Engineering and Telecoms)",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 0,
            "lab": 1
        },
        "majors": [
            {
                "majorType": "Επικοινωνίες και Δικτύωση (S5)",
                "cardinality": "B Βασικό"
            }
        ],
        "relevantCourses": {
            "mandatory": ["Ηλεκτρομαγνητισμός – Οπτική και Σύγχρονη Φυσική"]
        },
        "description": "Στοιχεία διανυσματικής ανάλυσης Εξισώσεις Maxwell σε διαφορική και ολοκληρωτική μορφή Εξίσωση κύματος Διάνυσμα Poynting και ισχύς κυμάτων Μιγαδική αναπαράσταση πεδίων. Αρμονικά πεδία. Επίπεδα κύματα Πόλωση κυμάτων. Ανάκλαση και Διάθλαση επίπεδων κυμάτων Βασικές παράμετροι κεραιών Ακτινοβολία στοιχειώδους διπόλου Γραμμικές κεραίες. Χαρακτηριστικοί τύποι κεραιών Ανάλυση και Σύνθεση στοιχειοκεραιών",
        "additionalInformation": {
            "links": [
                {
                    "name": "Κύματα, Κυματοδηγοί, Κεραίες - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D425"
                }
            ],
            "bibliography": [
                "Σημειώσεις, Θ. Σφηκόπουλος",
                "Εφαρμοσμένος Ηλεκτρομαγνητισμός, L. C. Shen, J. A. Kong, Εκδόσεις ΙΩΝ, 2003",
                "Κεραίες - Ανάλυση και Σχεδίαση, C.A. Balanis, Εκδόσεις ΙΩΝ, 2005"
            ]
        }
    },
    {
        "courseId": "15100204",
        "courseName": "Προγραμματισμός Συστήματος",
        "semester": [6],
        "category": "Υποχρεωτικό",
        "fieldOfStudies": "",
        "ects": 8,
        "teachingHours": {
            "theory": 4,
            "tutoring": 0,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": ["Δομές Δεδομένων και Τεχνικές Προγραμματισμού"],
            "optional": ["Αρχιτεκτονική Υπολογιστών Ι"]
        },
        "description": "Ο στόχος αυτού του μαθήματος είναι να εξετάσει σε βάθος το περιβάλλον Unix ως περιβάλλον ανάπτυξης. Θα εξετάσουμε την προγραμματιστική διεπαφή (API) του Linux για τις γλώσσες C/C++ καθώς επίσης και το κέλυφος (shell) του Linux. Θα καλύψουμε θέματα όπως: βοηθητικά προγράμματα του Unix, προγραμματισμός σε κέλυφος (shell programming), γλώσσες σεναρίων (script languages), προγραμματισμός λειτουργιών συστήματος σε C/C++ για χειρισμό λαθών, δημιουργία και τερματισμό διεργασιών, αποστολή/παραλαβή σημάτων, είσοδο/έξοδο χαμηλού επιπέδου, επικοινωνία μεταξύ τοπικών διεργασιών, δημιουργία, τερματισμό και συγχρονισμό νημάτων, διαχείριση συστήματος αρχείων, καθώς επίσης και μηχανισμοί απομακρυσμένης επικοινωνίας. Από τη φύση του, το μάθημα αυτό χρειάζεται αυτενέργεια και συνεχή προσωπική προσπάθεια.",
        "additionalInformation": {
            "links": [
                {
                    "name": "http://cgi.di.uoa.gr/~mema/courses/k24/k24.html",
                    "url": "http://cgi.di.uoa.gr/~mema/courses/k24/k24.html"
                },
                {
                    "name": "http://cgi.di.uoa.gr/~antoulas/k24/",
                    "url": "http://cgi.di.uoa.gr/~antoulas/k24/"
                }
            ],
            "bibliography": [
                "Βασικό σύγγραμμα: Peter S. Pacheco. M.J. Rochkind, Advanced Unix Programming, Prentice-Hall Software Series, Englewood Cliffs, NJ, 2004.",
                "Επικουρικό σύγγραμμα: Kay Robbins, Steven Robbins, \"Unix Systems Programming: Communication, Concurrency, and Threads\", Prentice Hall PTR, 2003."
            ]
        }
    },
    {
        "courseId": "15100206",
        "courseName": "Αναγνώριση Προτύπων–Μηχανική Μάθηση",
        "semester": [6],
        "category": "Προαιρετικό",
        "fieldOfStudies": "",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 0
        },
        "majors": [
            {
                "majorType": "Διαχείριση Δεδομένων και Γνώσης (S2)",
                "cardinality": "B Βασικό"
            },
            {
                "majorType": "Επεξεργασία Σήματος και Πληροφορίας (S6)",
                "cardinality": "B Βασικό"
            }
        ],
        "relevantCourses": {
            "mandatory": ["Πιθανότητες και Στατιστική"]
        },
        "description": "",
        "additionalInformation": {
            "links": [],
            "bibliography": []
        }
    },
    {
        "courseId": "15100456",
        "courseName": "Ασύρματα Δίκτυα Αισθητήρων",
        "semester": [6],
        "category": "Προαιρετικό",
        "fieldOfStudies": "CΕT (Computer Engineering and Telecoms)",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 0,
            "lab": 1
        },
        "majors": [
            {
                "majorType": "Υλικό και Αρχιτεκτονική (S4)",
                "cardinality": "B Βασικό"
            },
            {
                "majorType": "Επικοινωνίες και Δικτύωση (S5)",
                "cardinality": "B Βασικό"
            }
        ],
        "relevantCourses": {
            "mandatory": ["Λειτουργικά Συστήματα"]
        },
        "description": "",
        "additionalInformation": {
            "links": [],
            "bibliography": []
        }
    },
    {
        "courseId": "15100413",
        "courseName": "Δομή και Θεσμοί της Ευρωπαϊκής Ένωσης",
        "semester": [7],
        "category": "Γενικής Παιδείας",
        "fieldOfStudies": "",
        "ects": 2,
        "teachingHours": {
            "theory": 2,
            "tutoring": 0,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": []
        },
        "description": "Το μάθημα παρουσιάζει τις σημαντικότερες πτυχές της ευρωπαϊκής οικονομικής και πολιτικής ολοκλήρωσης και καλύπτει τα παρακάτω θέματα: Βασικές έννοιες και μεθοδολογία προσέγγισης του ενωσιακού φαινομένου. Οικονομική ολοκλήρωση και πολιτική ενοποίηση. Βασικές θεωρίες για την πολιτική ενοποίηση (Ομοσπονδισμός, νεολειτουργισμός, αλληλεξάρτηση, θεωρία διεθνών καθεστώτων, διακυβερνητισμός), κριτική αξιολόγηση των θεωριών αυτών. Η έννομη τάξη της Ευρωπαϊκής Ένωσης, πρωτογενές και δευτερογενές δίκαιο. Θεσμική συγκρότηση, ανάπτυξη και εξέλιξη του θεσμικού συστήματος. Διαδικασίες διαμόρφωσης πολιτικής και λήψης αποφάσεων. Βασικές πολιτικές (οικονομική πολιτική, έρευνας, απασχόλησης και ένταξης στην αγορά εργασίας, εκπαίδευσης, επαγγελματικής κατάρτισης και δια βίου μάθησης). Διαθρωτικά ταμεία, χρηματοδοτήσεις και προγράμματα της Ευρωπαϊκής Ένωσης.",
        "additionalInformation": {
            "links": [
                {
                    "name": "ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D82/"
                }
            ],
            "bibliography": [
                "Μαραβέγιας, Ν. & Τσινισιζέλης, Μ. Η Νέα Ευρωπαϊκή Ένωση, Οργάνωση και Πολιτικές, 50 χρόνια. Εκδόσεις Θεμέλιο 2007.",
                "Γιώτη - Παπαδάκη, Ο. «Ευρωπαϊκή Πολιτική Ολοκλήρωση και Πολιτικές Αλληλεγγύης». Εκδόσεις Κριτική 2004.",
                "Ιωακειμίδης, Π.Κ,. Ευρωπαϊκή Πολιτική Ένωση. Εκδόσεις Θεμέλιο, 1995.",
                "Ιωακειμίδης, Π.Κ,. Ευρωπαϊκή Πολιτική Ένωση. Θεωρία, Διαπραγμάτευση, Θεσμοί και Πολιτικές, Αθήνα, Θεμέλιο, 1993.",
                "Λάβδας, Κ.Α. Δημιουργία και εξέλιξη της Ευρωπαϊκής Κοινότητας. ΕΑΠ, 2003.",
                "Ελληνική Πανεπιστημιακή Ένωση Ευρωπαϊκών Σπουδών. Εισαγωγή στις Ευρωπαϊκές Σπουδές Τόμος Α: Εκδόσεις Σιδέρης, 2001.",
                "Μούσης, Ν,. Από την Ευρωπαϊκή Κοινότητα στην Ευρωπαϊκή Ένωση-Θεσμοί και Πολιτικές. Εκδόσεις Παπαζήσης, 2000.",
                "Ανδρικοπούλου, Ε. & Καυκαλάς, Γρ. (επιμ.). Ο νέος ευρωπαϊκός χώρος. Η διεύρυνση και η γεωγραφία της ευρωπαϊκής ανάπτυξης, Αθήνα, Θεμέλιο, 2000."
            ]
        }
    },
    {
        "courseId": "15100301",
        "courseName": "Επικοινωνία Ανθρώπου Μηχανής",
        "semester": [7],
        "category": "Προαιρετικό",
        "fieldOfStudies": "CS (Computer Science)",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 0
        },
        "majors": [
            {
                "majorType": "Διαχείριση Δεδομένων και Γνώσης (S2)",
                "cardinality": "B Βασικό"
            },
            {
                "majorType": "Λογισμικό (S3)",
                "cardinality": "B Βασικό"
            }
        ],
        "relevantCourses": {
            "mandatory": ["Σχεδίαση και Χρήση Βάσεων Δεδομένων"]
        },
        "description": "Το μάθημα ΥΣ08 Επικοινωνία Ανθρώπου-Μηχανής καλύπτει ένα πλήθος από βασικά θέματα που αφορούν στην αλληλεπίδραση του ανθρώπου με τους υπολογιστές. Οι διαλέξεις δομούνται ως εξής: Εισαγωγή στην Επικοινωνία Ανθρώπου-Μηχανής (ΕΑΜ), χαρακτηριστικά του ανθρώπου που αφορούν την επικοινωνία του με τους υπολογιστές, αισθήσεις και αισθητήρια όργανα, όραση και οπτική αντίληψη, ακοή, κίνηση, ανθρώπινη μνήμη, μνήμη αισθήσεων και μνήμη εργασίας, λειτουργίες μακροπρόθεσμης μνήμης, μεταφορές, χαρακτηριστικά του υπολογιστή που αφορούν την επικοινωνία του με τους ανθρώπους, θέματα της επικοινωνίας των ανθρώπων με τις μηχανές, εργονομία, σχεδίαση διαλόγου, σχεδίαση οθόνης, βασικές αρχές χρηστικότητας που επηρεάζουν την δυνατότητα εκμάθησης, την ευελιξία, και την ευρωστία, κύκλος ανάπτυξης και ζωής λογισμικού επικοινωνίας ανθρώπου-μηχανής, τύποι επαναληπτικού σχεδιασμού και πρωτοτυποποίησης, μεθοδολογίες σχεδίασης (πληροφοριακά συστήματα βασισμένα σε θέματα, ανάλυση χώρου σχεδιασμού), ανάλυση απαιτήσεων και καταγραφή προδιαγραφών, οδηγίες και πρότυπα, μηχανική χρηστικότητας, σχεδίαση συστημάτων ΕΑΜ, μοντελοποίηση χρηστών (μοντέλο GOMS και μοντέλο KLM), σχεδιασμός διεπαφών τύπου Παράθυρα-Εικονίδια-Ποντίκια-Επιλογείς (ΠΕΠΕ) και για το Παγκόσμιο Πλέγμα Πληροφοριών, στοιχεία ΗΤΜL και Javascript, αξιολόγηση συστημάτων, οπτικοποίηση δεδομένων, μελλοντικές τάσεις.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Επικοινωνία Ανθρώπου Μηχανής - eClass",
                    "url": "https://eclass.uoa.gr/courses/D54"
                }
            ],
            "bibliography": [
                "Αβούρης, Ν., Κατσάνος, Χ., Τσέλιος, Ν., & Μουστάκας, Κ. (2016). Εισαγωγή στην Επικοινωνία Ανθρώπου-Υπολογιστή. Πάτρα: Εκδόσεις Πανεπιστημίου Πατρών. (Σύνδεσμος στον Εύδοξο: https://service.eudoxus.gr/search/#a/id:59366672/0)",
                "Shneiderman, B., & Plaisant, C. (2010). Σχεδίαση διεπαφής χρήστη: Στρατηγικές για αποτελεσματική επικοινωνία ανθρώπου - υπολογιστή. Mετάφραση: Γιώργος Καλπάκης. (Σ. Κατσαβούνης, Ed.) (1st ed.). Θεσσαλονίκη: Εκδόσεις Τζιόλα."
            ]
        }
    },
    {
        "courseId": "15100207",
        "courseName": "Οπτικές Επικοινωνίες και Οπτικά Δίκτυα",
        "semester": [7],
        "category": "Προαιρετικό",
        "fieldOfStudies": "CΕT (Computer Engineering and Telecoms)",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 0
        },
        "majors": [
            {
                "majorType": "Υλικό και Αρχιτεκτονική (S4)",
                "cardinality": "B Βασικό"
            },
            {
                "majorType": "Επικοινωνίες και Δικτύωση (S5)",
                "cardinality": "B Βασικό"
            }
        ],
        "relevantCourses": {
            "mandatory": ["Ηλεκτρομαγνητισμός – Οπτική και Σύγχρονη Φυσική"],
            "optional": ["Κύματα, Κυματοδηγοί, Κεραίες"]
        },
        "description": "Βασικά δομικά και λειτουργικά χαρακτηριστικά συστημάτων οπτικών επικοινωνιών και δικτύων. Χαρακτηριστικά διάδοσης σημάτων σε οπτική ίνα, οπτικοί πομποί, οπτικοί ενισχυτές, οπτικά φίλτρα, φωτοδέκτες. Αρχιτεκτονικές συστημάτων οπτικών επικοινωνιών, σχήματα διαμόρφωσης/αποδιαμόρφωσης. Γραμμικά και μη γραμμικά συστήματα οπτικών επικοινωνιών υψηλού ρυθμού. Συστήματα οπτικής πολυπλεξίας χρόνου και πολυπλεξίας μήκους κύματος. Βασικές αρχιτεκτονικές οπτικών μητροπολιτικών και δικτύων κορμού.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Οπτικές Επικοινωνίες και Οπτικά Δίκτυα - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D68/"
                }
            ],
            "bibliography": [
                "«Συστήματα Επικοινωνιών με Οπτικές Ινες», G.P.Agrawal, Τέταρτη έκδοση 2012, Εκδ. Τζιόλα"
            ]
        }
    },
    {
        "courseId": "15100454",
        "courseName": "Διοίκηση Έργων και Τεχνικές Παρουσίασης και Συγγραφής Επιστημονικών Εκθέσεων",
        "semester": [8],
        "category": "Γενικής Παιδείας",
        "fieldOfStudies": "",
        "ects": 2,
        "teachingHours": {
            "theory": 2,
            "tutoring": 0,
            "lab": 0
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": [],
            "optional": []
        },
        "description": "Το μάθημα περιλαμβάνει τον βασικό κορμό γνώσεων και δεξιοτήτων στη Διοίκηση Έργων και καλύπτει τα παρακάτω θέματα: Εισαγωγή στη Διοίκηση - Διαχείριση των έργων - βασικές έννοιες. Κύκλος ζωής, φάσεις και βασικά στοιχεία στη Διοίκηση Έργων. Περιβάλλον των έργων, ενδιαφερόμενα μέρη, ρόλοι και υπευθυνότητες. Οργανωτικές δομές στην εκτέλεση των έργων. Επιλογή των έργων - μέθοδοι επιλογής (Ανάλυση κόστους όφελος, περίοδος αποπληρωμής επενδυμένων κεφαλαίων, απόδοση της επένδυσης, καθαρή παρούσα αξία). Δομική ανάλυση των έργων. Χρονικός προγραμματισμός, μέθοδοι προγραμματισμού. Προγραμματισμός και κατανομή πόρων, τύποι πόρων. Οικονομική προσέγγιση των έργων - κοστολόγηση. Διαχείριση κινδύνων και αβεβαιότητας (αναγνώριση κινδύνων, αποτίμηση, σχέδιο διαχείρισης). Παρακολούθηση και έλεγχος των έργων, τεχνικές και περιεχόμενο ελέγχου. Αξιολόγηση των έργων.",
        "additionalInformation": {
            "links": [
                {
                    "name": "ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D82/"
                }
            ],
            "bibliography": [
                "Burke, R, Διαχείριση Έργων - Project Management. Τεχνικές Σχεδιασμού και Ελέγχου. Εκδόσεις Κριτική, 2002.",
                "Δημητριάδης, Α,. Διοίκηση - Διαχείριση Έργου. Εκδόσεις Νέων Τεχνολογιών, 2004.",
                "Πολύζος, Σ,. Διοίκηση και διαχείριση των έργων. Εκδόσεις Κριτική, 2011.",
                "Maylor, H,. Διαχείριση Έργων. Εκδόσεις Κλειδάριθμος, 2005.",
                "Verzuh, E, . Εισαγωγή στην Διαχείριση Έργου. Εκδόσεις Σταμούλη, 2002.",
                "Σημειώσεις μαθήματος."
            ]
        }
    },
    {
        "courseId": "15100148",
        "courseName": "Υπολογιστική Γεωμετρία",
        "semester": [8],
        "category": "Προαιρετικό",
        "fieldOfStudies": "CS (Computer Science)",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 1,
            "lab": 0
        },
        "majors": [
            {
                "majorType": "Θεμελιώσεις Πληροφορικής (S1)",
                "cardinality": "B Βασικό"
            }
        ],
        "relevantCourses": {
            "mandatory": ["Αλγόριθμοι και Πολυπλοκότητα"]
        },
        "description": "Εισαγωγή στους Γεωμετρικούς Αλγόριθμους και προεκτάσεις προς τις ερευνητικά ενεργές περιοχές της Υπολογιστικής Γεωμετρίας. Eιδικότερα:\nKυρτότητα σε δύο διαστάσεις και σε τρεις διαστάσεις, αλλά και σε γενική διάσταση.\nΌγκος κυρτών πολυέδρων και Minkowski άθροισμα Πολυέδρων.\nΤριγωνοποίηση σημειοσυνόλου και Τριγωνοποίηση Delaunay / διαγραμμα Voronoi.\nΘέματα Γεωμετρικής αναζήτησης, Δομές γεωμετρικών δεδομένων, Πλησιέστεροι γείτονες, Ομαδοποίηση.\nΕπίσης, παρουσιάζονται θέματα υλοποίησης γεωμετρικών αλγορίθμων και χρήσης βιβλιοθηκών (π.χ. CGAL) για την ανάπτυξη γεωμετρικού λογισμικού σε γλώσσες όπως C/C++, και Python.",
        "additionalInformation": {
            "links": [
                {
                    "name": "Υπολογιστική Γεωμετρία - ECLASS",
                    "url": "https://eclass.uoa.gr/courses/D42/"
                }
            ],
            "bibliography": [
                "Ιωάννης Εμίρης. Υπολογιστική γεωμετρία: μία σύγχρονη αλγοριθμική προσέγγιση. Κλειδάριθμος, 2008.",
                "Mark Overmars et al. Computational geometry and Applications. Springer. Μετάφραση: Πανεπιστημιακές εκδόσεις Κρήτης, 2011.",
                "Σημειώσεις και Διαφάνειες για την εισαγωγή στην Python."
            ]
        }
    },
    {
        "courseId": "15100067",
        "courseName": "Επεξεργασία Εικόνας",
        "semester": [8],
        "category": "Προαιρετικό",
        "fieldOfStudies": "",
        "ects": 6,
        "teachingHours": {
            "theory": 3,
            "tutoring": 0,
            "lab": 1
        },
        "majors": [],
        "relevantCourses": {
            "mandatory": ["Ψηφιακή Επεξεργασία Σήματος"]
        },
        "description": "Στοιχεία συστημάτων ψηφιακής επεξεργασίας εικόνας και βασικές έννοιες. Βασικοί δισδιάστατοι μετασχηματισμοί και αναπαραστάσεις εικόνας (Fourier, Walsh Hadamard, KL μετασχηματισμός διακριτού συνημιτόνου (DCT), γρήγορες υλοποιήσεις, αναπαράσταση εικόνας στο MATLAB, βασικές εντολές χειρισμού εικόνων στο MATLAB. Βελτίωση εικόνας (μετασχηματισμοί έντασης, εξισορρόπηση ιστογράμματος, χωρικά φίλτρα, φίλτρα επιλογής συχνοτήτων, ομομορφικά φίλτρα). Επεξεργασία έγχρωμης εικόνας (βασικά χρωματικά υποδείγματα, ψευδοχρωματισμός, επεξεργασία πλήρους χρώματος, βασικές εντολές στο MATLAB). Aποκατάσταση εικόνας (υποδείγματα παραμορφώσεων, αντίστροφα φίλτρα και φιλτρο Wiener, προσαρμοστικό φίλτρο Wiener, βασικές εντολές στο MATLAB). Συμπίεση και κωδικοποίηση (Μορφές πληροφοριακού πλεονάσματος και κριτήρια πιστότητας, σχεδιασμός κβαντιστών Max Loyd, υποδείγματα συμπίεσης και κωδικοποίησης (προγνωστική κωδικοποίηση, DPCM, κα, συμπίεση με/χωρίς απώλειες, standards βασικές εντολές στο MATLAB). Κατάτμηση εικόνας (ανίχνευση ασυνεχειών σημείου ευθείας ακμών, μετασχηματισμός Hough, κατωφλίωση, κατάτμηση με περιοχές, κωδικοποίηση αλυσίδας, περιγραφείς συνόρου, υφή, μορφολογική επεξεργασία).",
        "additionalInformation": {
            "links": [
                {
                    "name": "Επεξεργασία Εικόνας - eClass",
                    "url": "https://eclass.uoa.gr/courses/D69/"
                }
            ],
            "bibliography": [
                "Ιωάννης Πήτας, \"Ψηφιακή επεξεργασία εικόνας\", 4η έκδοση, Θεσσαλονίκη, 2010 (ISBN: 978-960-9156435)",
                "Ν. Παπαμάρκος, \"Ψηφιακή επεξεργασία και ανάλυση εικόνας\", Β. Γκιούρδας Εκδοτική, 2010 (ISBN: 978-960-92731)",
                "Ralph Gonzalez, \"Digital Image Processing Using MATLAB\", 4η έκδοση, Pearson, 2018 (ISBN-13: 978-9353062989)"
            ]
        }
    }
]